In [1]:
canasta1 = ["naranja", "pera", "manzana"]
canasta2 = ["naranja", "frutilla"]

In [2]:
for fruta in canasta1:
    if fruta in canasta2:
        canasta2.remove(fruta)

In [3]:
canasta2

['frutilla']

In [4]:
while canasta1:
    item_to_transfer = canasta1.pop()
    canasta2.append(item_to_transfer)

In [5]:
canasta2

['frutilla', 'manzana', 'pera', 'naranja']

In [6]:
canasta1

[]

In [7]:
import pandas as pd

In [8]:
data = {'genero':['femenino', 'masculino'], 'edad':[13,89]}

In [9]:
df = pd.DataFrame(data)

In [10]:
df

      genero  edad
0   femenino    13
1  masculino    89

In [15]:
df.replace({'genero': {'masculino': 'male'}},inplace=True)

In [16]:
df

     genero  edad
0  femenino    13
1      male    89

In [19]:
df.rename(columns={'genero':'Genero', 'edad':'Edad'},inplace=True)

In [20]:
df

     Genero  Edad
0  femenino    13
1      male    89

In [1]:
import pandas as pd

In [19]:
dfNba = pd.read_csv('nba.csv', index_col = "Name")

In [20]:
dfNba.head()

,Team,Number,Position,Age,Height,Weight,College,Salary
Name,,,,,,,,
Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0

In [21]:
dfNba.iloc[0]

Team        Boston Celtics
Number                   0
Position                PG
Age                     25
Height                 6-2
Weight                 180
College              Texas
Salary         7.73034e+06
Name: Avery Bradley, dtype: object

In [23]:
dfNba.loc["Avery Bradley"]

Team        Boston Celtics
Number                   0
Position                PG
Age                     25
Height                 6-2
Weight                 180
College              Texas
Salary         7.73034e+06
Name: Avery Bradley, dtype: object

In [24]:
import numpy as np

In [31]:
dTest = {'score1':[100, 90, np.nan, 95], 'score2':[30, 45, 56, np.nan]}

In [32]:
dfTest2 = pd.DataFrame(dTest)

In [33]:
dfTest2.isnull()

   score1  score2
0   False   False
1   False   False
2    True   False
3   False    True